const ctx = document.getElementById("line-chart")

export const lineChart = new Chart(ctx, {
    type: "line",
    data: {
        labels: [
            "Январь",
            "Февраль",
            "Март",
            "Апрель",
            "Май",
            "Июнь",
            "Июль",
            "Август",
            "Сентябрь",
            "Октябрь",
            "Ноябрь",
            "Декабрь",
            "Январь 2",
            "Февраль 2",
            "Март 2",
            "Апрель 2",
            "Май 2",
            "Июнь 2",
            "Июль 2",
            "Август 2",
            "Сентябрь 2",
            "Октябрь 2",
            "Ноябрь 2",
            "Декабрь 2",
            "Январь 3",
            "Февраль 3",
            "Март 3",
            "Апрель 3",
            "Май 3",
            "Июнь 3",
            "Июль 3",
            "Август 3",
            "Сентябрь 3",
            "Октябрь 3",
            "Ноябрь 3",
            "Декабрь 3",
            "Январь 4",
            "Февраль 4",
            "Март 4",
            "Апрель 4",
            "Май 4",
            "Июнь 4",
            "Июль 4",
            "Август 4",
            "Сентябрь 4",
            "Октябрь 4",
            "Ноябрь 4",
            "Декабрь 4",
            "Январь 5",
            "Февраль 5",
            "Март 5",
            "Апрель 5",
            "Май 5",
            "Июнь 5",
            "Июль 5",
            "Август 5",
            "Сентябрь 5",
            "Октябрь 5",
            "Ноябрь 5",
            "Декабрь 5",
            "Январь 6",
            "Февраль 6",
            "Март 6",
            "Апрель 6",
            "Май 6",
            "Июнь 6",
            "Июль 6",
            "Август 6",
            "Сентябрь 6",
            "Октябрь 6",
            "Ноябрь 6",
            "Декабрь 6",
        ],
        datasets: [
            {
                label: "Данные чего-то от чего-то",
                data: [
                    6012, 114, 18, 30, 12, 18, 72, 114, 18, 30, 12, 18, 6012, 114, 18, 30,
                    12, 18, 72, 114, 18, 30, 12, 18, 6012, 114, 18, 30, 12, 18, 72, 114,
                    18, 30, 12, 18, 6012, 114, 18, 30, 12, 18, 72, 114, 18, 30, 12, 18,
                    6012, 114, 18, 30, 12, 18, 72, 114, 18, 30, 12, 18, 6012, 114, 18, 30,
                    12, 18, 72, 114, 18, 30, 12, 18,
                ],
                borderColor: "rgb(22,22,222)",
                borderWidth: 2,
                fill: false,
                tension: 0.1,
            },
            {
                label: "Другие данные",
                data: [
                    60, 90, 150, 180, 240, 210, 300, 360, 420, 480, 540, 600, 60, 90, 150,
                    180, 240, 210, 300, 360, 420, 480, 540, 600, 60, 90, 150, 180, 240,
                    210, 300, 360, 420, 480, 540, 600, 60, 90, 150, 180, 240, 210, 300,
                    360, 420, 480, 540, 600, 60, 90, 150, 180, 240, 210, 300, 360, 420,
                    480, 540, 600, 60, 90, 150, 180, 240, 210, 300, 360, 420, 480, 540,
                    600,
                ],
                borderColor: "rgb(38,141,12)",
                borderWidth: 2,
                fill: false,
                tension: 0.1,
            },
        ],
    },
    options: {
        responsive: true,
        plugins: {
            zoom: {
                zoom: {
                    wheel: {
                        enabled: true, // Включает зумирование с колесиком мыши
                    },
                    pinch: {
                        enabled: true, // Включает зумирование с помощью жестов (на мобильных устройствах)
                    },
                    mode: "xy", // Позволяет зуммировать по обеим осям
                },
                pan: {
                    enabled: true,
                    mode: "xy", // Позволяет панорамировать по обеим осям
                    threshold: 10, // Минимальное перемещение для начала панорамирования
                },
            },
        },
        elements: {
            line: {
                tension: 0.1, // Установка сглаживания линий
            },
        },
    },
});

// Добавляем обработчик события для кнопки сброса зума
document.getElementById("resetZoom").addEventListener("click", function () {
    lineChart.resetZoom(); // Сбрасывает зум
});