import TimelineEditor from "./timelineEditor.js";



const data = [{
  "x": "2024-08-01T03:53:03.671Z",
  "y": 10519
},
{
  "x": "2024-08-01T03:53:19.873Z",
  "y": 10518
},
{
  "x": "2024-08-01T03:53:25.274Z",
  "y": 10519
},
{
  "x": "2024-08-25T17:20:45.229Z",
  "y": 5681.463
},
{
  "x": "2024-08-25T17:20:50.631Z",
  "y": 5680.822
},
{
  "x": "2024-08-25T17:20:56.035Z",
  "y": 5679.968
},
{
  "x": "2024-08-25T17:21:01.439Z",
  "y": 5679.328
},
{
  "x": "2024-08-25T17:21:06.838Z",
  "y": 5678.474
},
{
  "x": "2024-08-25T17:21:12.236Z",
  "y": 5677.619
},
{
  "x": "2024-08-25T17:21:17.639Z",
  "y": 5676.978
},
{
  "x": "2024-08-25T17:21:23.043Z",
  "y": 5676.124
},
{
  "x": "2024-08-25T17:21:28.440Z",
  "y": 5675.27
},
{
  "x": "2024-08-25T17:21:33.831Z",
  "y": 5674.629
},
{
  "x": "2024-08-25T17:21:39.227Z",
  "y": 5673.775
},
{
  "x": "2024-08-25T17:21:44.626Z",
  "y": 5673.134
},
{
  "x": "2024-08-25T17:21:50.029Z",
  "y": 5672.279
},
{
  "x": "2024-08-25T17:21:55.431Z",
  "y": 5671.425
},
{
  "x": "2024-08-25T17:22:00.811Z",
  "y": 5670.57
},
{
  "x": "2024-08-25T17:22:06.219Z",
  "y": 5669.93
},
{
  "x": "2024-08-25T17:22:11.619Z",
  "y": 5669.076
},
{
  "x": "2024-08-25T17:22:17.022Z",
  "y": 5668.435
},
{
  "x": "2024-08-25T17:22:22.421Z",
  "y": 5667.581
},
{
  "x": "2024-08-25T17:22:27.819Z",
  "y": 5666.726
},
{
  "x": "2024-08-25T17:22:33.219Z",
  "y": 5666.085
},
{
  "x": "2024-08-25T17:22:38.623Z",
  "y": 5665.444
},
{
  "x": "2024-08-25T17:22:44.021Z",
  "y": 5664.591
},
{
  "x": "2024-08-25T17:22:49.423Z",
  "y": 5663.95
},
{
  "x": "2024-08-25T17:22:54.823Z",
  "y": 5663.096
},
{
  "x": "2024-08-25T17:23:00.214Z",
  "y": 5662.241
},
{
  "x": "2024-08-25T17:23:05.620Z",
  "y": 5661.6
},
{
  "x": "2024-08-25T17:23:11.021Z",
  "y": 5660.853
},
{
  "x": "2024-08-25T17:23:16.420Z",
  "y": 5660.318
},
{
  "x": "2024-08-25T17:23:21.821Z",
  "y": 5659.038
},
{
  "x": "2024-08-25T17:23:27.220Z",
  "y": 5658.61
},
{
  "x": "2024-08-25T17:23:32.622Z",
  "y": 5657.756
},
{
  "x": "2024-08-25T17:23:38.018Z",
  "y": 5657.115
},
{
  "x": "2024-08-25T17:23:43.422Z",
  "y": 5656.26
},
{
  "x": "2024-08-25T17:23:48.819Z",
  "y": 5655.407
},
{
  "x": "2024-08-25T17:23:54.220Z",
  "y": 5654.766
},
{
  "x": "2024-08-25T17:23:59.618Z",
  "y": 5654.125
},
{
  "x": "2024-08-25T17:24:05.017Z",
  "y": 5652.63
},
{
  "x": "2024-08-25T17:24:10.413Z",
  "y": 5652.523
},
{
  "x": "2024-08-25T17:24:15.813Z",
  "y": 5651.562
},
{
  "x": "2024-08-25T17:24:21.214Z",
  "y": 5650.707
},
{
  "x": "2024-08-31T20:59:00.719Z",
  "y": 5650.707
}
]

const timelineEditor = new TimelineEditor(data)
// timelineEditor.edit()

const ctx = document.getElementById("line-chart")

export const lineChart = new Chart(ctx, {
  type: "line",
  data: {
    datasets: [{
      label: "Данные от времени",
      data: timelineEditor.edit(),
      borderColor: "rgb(3,3,30)",
      borderWidth: 2,
      fill: false,
      tension: 0.1,
    },],
  },
  options: {
    responsive: true,
    scales: {
      x: {
        type: "time",
        time: {
          unit: "day", // Начальное отображение — дни
          displayFormats: {
            second: "MMM dd, HH:mm:ss", // Формат для секунд
            minute: "MMM dd, HH:mm", // Формат для минут
            hour: "MMM dd, HH:mm", // Формат для часов
            day: "MMM dd", // Формат для дней
          },
        },
        ticks: {
          maxTicksLimit: 8, // Задаём ровно 8 делений
        },
        title: {
          display: true,
          text: "Время",
        },
      },
      y: {
        title: {
          display: true,
          text: "Значение",
        },
      },
    },
    plugins: {
      zoom: {
        zoom: {
          wheel: {
            enabled: true,
          },
          pinch: {
            enabled: true,
          },
          mode: "x",
          onZoom: ({
            chart
          }) => {
            const min = chart.scales.x.min;
            const max = chart.scales.x.max;
            const range = max - min;

            // Логика изменения единиц времени на оси X
            if (range <= 1000 * 60) { // Если зумируем до диапазона меньше минуты
              chart.scales.x.options.time.unit = "second";
            } else if (range <= 1000 * 60 * 60) { // Если зумируем до диапазона меньше часа
              chart.scales.x.options.time.unit = "minute";
            } else if (range <= 1000 * 60 * 60 * 24) { // Если зумируем до диапазона меньше дня
              chart.scales.x.options.time.unit = "hour";
            } else { // Для более крупных диапазонов
              chart.scales.x.options.time.unit = "day";
            }
            chart.update(); // Обновляем график после изменения настроек
          },
        },
        pan: {
          enabled: true,
          mode: "x",
        },
      },
    },
  },
});


document.getElementById("resetZoom").addEventListener("click", function () {
  lineChart.resetZoom()
})